In [12]:
import pandas as pd    #library for data manipulation and analysis
from datetime import datetime    #library to work with time data

In [13]:
#loading the CSV file and peek what is inside the Pandora's Box
df = pd.read_csv("CleanedDataInNoteBook.csv") 
df.info()
df.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 223409 entries, 0 to 223408
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Unnamed: 0     223409 non-null  int64
 1   _id            223409 non-null  int64
 2   time           223409 non-null  object
 3   cno            223409 non-null  int64
 4   in             223409 non-null  int64
 5   out            223409 non-null  int64
 6   date           223409 non-null  int64
 7   hours          223409 non-null  int64
 8   date_timedata  223409 non-null  object
dtypes: int64(7), object(2)
memory usage: 15.3+ MB

,Unnamed: 0,_id,time,cno,in,out,date,hours,date_timedata
0,98864,98865,2015-07-06T23:00:00,3,1,4,20150706,230000,2015-07-06
1,102321,102322,2015-07-06T20:00:00,6,0,4,20150706,200000,2015-07-06
2,102322,102323,2015-07-06T22:00:00,6,0,8,20150706,220000,2015-07-06
3,102318,102319,2015-07-06T17:00:00,6,149,166,20150706,170000,2015-07-06
4,102317,102318,2015-07-06T16:00:00,6,142,211,20150706,160000,2015-07-06

In [17]:
#grouping the data base on date
df=df.groupby(['date']).sum().reset_index()
print(df)

          date  Unnamed: 0       _id  cno    in   out     hours
0     20150706     2209472   2209494   96  1947  2957   3760000
1     20150707     3321587   3321620  150  1973  2645   4800000
2     20150708     3216318   3216350  141  3315  3360   4780000
3     20150709     3216832   3216864  141  3512  3333   4630000
4     20150710     2917101   2917130  129  3446  3367   4540000
...        ...         ...       ...  ...   ...   ...       ...
1444  20190620    32077512  32077656  552  4519  4450  16560000
1445  20190621    32098248  32098392  552  5876  5726  16560000
1446  20190622    32118984  32119128  552  2613  2466  16560000
1447  20190623    32150145  32150289  552  1767  1661  16560000
1448  20190624    32150031  32150175  552  4607  4227  16560000

[1449 rows x 7 columns]

In [18]:
interestedDate=input("type in date you are interested in, format should be yearmonth date, example=20160101")

type in date you are interested in, format should be yearmonth date, example=2016010120170303

In [24]:
#iterate through the dataframe
for index,row in df.iterrows():
    #print(row['date'])
    if row['date']==int(interestedDate):
        print(row['date'])
        print("catched")
        print(row['in'])

20170303
catched
3893

In [25]:
interestedDateForFourYears=input("type in date you are interested in, format should be yearmonth date, example=20150101")

type in date you are interested in, format should be yearmonth date, example=2015010120150909

In [35]:
#iterate through the dataframe
print('here is the same date in different year you asked for')
for index,row in df.iterrows():
    #print(row['date'])
    if row['date']==int(interestedDateForFourYears):
        print(row['date'],':')
        print(row['in'])
    elif row['date']==(int(interestedDateForFourYears)+10000):
        print(row['date'],':')
        print(row['in'])
    elif row['date']==(int(interestedDateForFourYears)+20000):
        print(row['date'],':')
        print(row['in'])
    elif row['date']==(int(interestedDateForFourYears)+30000):
        print(row['date'],':')
        print(row['in'])

20150909 :
5192
20160909 :
4302
20170909 :
3733
20180909 :
3759